blog/recipes.org
#+TITLE:       Recipes
#+AUTHOR:      Thomas Moulia
#+EMAIL:       jtmoulia@gmail.com
#+DATE:        2018-12-29 Sat
#+URI:         /blog/%y/%m/%d/recipes
#+KEYWORDS:    food, recipes
#+TAGS:        food
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: Some food recipes.

A collection of food recipes.

* Bread

** [breadmaker] Fluffy and Sweet

   Large white loaf

   - 1 1/4 cup of body temp water
   - 2 tbs oil
   - 2 tbs honey
   - 1 1/2 tsp yeast
   - 3 1/4 cup flour
   - 2 tsp salt
   - 1 tsp vital wheat gluten (to make it fluffy)

** Hamed's Bread

*** Ingredients

- 3 1/4 cups flour
- 1 tsp salt
- 3 tsp sugar
- 2 tsp canola (olive!?) oil
- 1 sachet yeast
- 
- 1 1/2 cup water

*** Steps

1. mix the flour, sugar, salt, and yeast. Set aside this dry mix
2. mix water and oil
3. add the dry to the wet and give a good mix. Set aside this starter to rise
   1. you can mix in a
4. Knead the bread
   
* Pickles
** Salt + Vinegar Hot Pickled Cukes

   Best way to figure this out is mix up a picklin juice that tastes like the
   pickles you want.

   Then boil the juice, and add it to a jar packed with veggies.

   Harder veggies [carrots!] can be par-boiled first.

   First cut used much salt and a bit less white vinegar.

   Ideas for mix-ins:

   - Mustard seeds (crushed?)
   - Dill
   - Crushed peppers
   - Chopped garlic
   - Jalapenos

* Granola
** Basic

   1. Mix granola + nut + berry shit [dry]
   2. Separately mix maple syrup [2?] egg white, vanilla to taste [wet]
   3. Keep dry stuff moist with wet stuff
   4. Bake @ 250℉ until it starts to brown
   5. Crack door + turn off oven
   6. Leave until super crispy

* Baked Veggies
** Roasted Broccoli / Cauliflower / Brussel Sprouts

- Preheat oven to 400℉ for crispy
- Chop down veggies
- Spread veggies across cooking pan
- Sprinkle with oil & flavor, e.g.
  - salt & pepper
  - vinegar (balsamic, rice)
  - soy sauce
  - hot sauce
  - ?
- Bake until just crispy, or to your taste

** Eggplant Parmesan

- 3 eggplant, thinly sliced
- 16oz mozzarella (shred)
- 1/2 cup grated parmesan
- 2 eggs, beaten
- 4 cups breadcrumbs

Bake until the top has that golden fried cheese look. It takes longer than I'd
expected to get the eggplant cooked all the way through.

* Sauces

** Roux

Equal parts flour and fat, mix with water and continuously stir over low heat
until completely smooth.

Awesome pie filler.

[[https://www.reaper.fm/][Reaper]] is an excellent digital audio workstation, but it's often bafflingly
complex. This page is a living reference of resoureces I've found useful for
working with Reaper.

** Tahini

*** Ingredients
- Sesame seeds
-
*** Steps

- Roast the sesame seeds
* Rice
** Basic Fried Rice

*** Ingredients

- oil
  - an oil with a high smoke point is good, e.g. grapeseed oil
- rice
  - fluff it up if it's been in the fridge
- onion
- garlic
  - diced
  - I usually go heavy, tossing in a few cloves
- ginger
  - can be grated right into the pan
- eggs
- some seasonings, e.g.
  - soy sauce
  - rice vinegar
  - garlic powder
  - salt & pepper

*** Steps

1. pour in the oil and heat it up to the verge of burning the oil
2. prepare and add in the slow cooking vegetables, e.g. onion, garlic, and ginger
   1. season with dry seasonings until tasty
   2. saute until the veggies are half-coked (golden rather than browned)
3. add and fry rice
   1. mix in the rest of the seasonings until tasty
   2. add more oil if necessary, but the less oil the fluffier the fry
   3. fry until browned on the bottom of the pan, then mix -- shift the pan and
      repeat until full of delicious brown chunks
4. shift the rice to the edges of the pan and add eggs to the middle
   1. before adding: mix and lightly season the eggs in a separate bowl
   2. let the eggs form up, then mix into the rest of the rice
