blog/2018/12/29/recipes/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Recipes - jtmoulia</title>
  <meta charset="utf-8" />
  <meta name="author" content="Thomas Moulia" />
    <meta name="description" content="Some food recipes." />
    <meta name="keywords" content="food, recipes" />
  <!-- TODO Concatenate CSS -->
  <link rel="stylesheet" href="/media/css/normalize.css" type="text/css">
  <link rel="stylesheet" href="/media/css/skeleton.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  <link href='https://fonts.googleapis.com/css?family=Merriweather:400,700,300italic' rel='stylesheet' type='text/css'>
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
</head>

  <body class="container">
<div class="masthead">
  <div class="masthead-title-div u-pull-left">
    <h1 class="masthead-title"><a href="/">
      jtmoulia
    </a></h1>
    <!-- TODO Who needs a sub-title?? -->
    <!-- <p class="masthead-sub-title"> -->
    <!-- public notebook 📓 -->
    <!-- </p> -->
  </div>
  <nav class="navbar u-pull-right">
    <ul class="navbar-list">
      <li><a href="/blog/">Posts</a></li>
      <li><a href="/about/">Who</a></li>
    </ul>
  </nav>
</div>
<div class="u-cf"></div>

    <!-- <div> -->
    <!--   <header class="masthead"> -->
    <!--     <h1 class="masthead-title"><a href="/">jtmoulia</a></h1> -->
    <!--     <p>public notebook 📓</p> -->
    <!--     <ul> -->
    <!--        -->
    <!--       <li><a href="/blog/">Blog</a></li> -->
    <!--        -->
    <!--       <li><a href="/tags/">Tags</a></li> -->
    <!--       <li><a href="/about/">About</a></li> -->
    <!--       <li><a href="http://github.com/jtmoulia">GitHub</a></li> -->
    <!--       <li><a href="/rss.xml">RSS</a></li> -->
    <!--     </ul> -->
    <!--     <form method="get" id="searchform" action="http://www.google.com/search"> -->
    <!--       <input type="text" class="field" name="q" id="s" placeholder="Search"> -->
    <!--       <input type="hidden" name="as_sitesearch" value="jtmoulia.pocketknife.io"> -->
    <!--     </form> -->
    <!--      -->
    <!--   </header> -->
    <!-- </div> -->

  <hr />
<div class="content">
  <div class="post">
      <h3>Recipes</h3>
    <p>
A collection of food recipes.
</p>

<div id="outline-container-orga60a8ae" class="outline-4">
<h4 id="orga60a8ae">Bread</h4>
<div class="outline-text-4" id="text-orga60a8ae">
</div>
<div id="outline-container-org8e32d53" class="outline-5">
<h5 id="org8e32d53">[breadmaker] Fluffy and Sweet</h5>
<div class="outline-text-5" id="text-org8e32d53">
<p>
Large white loaf
</p>

<ul class="org-ul">
<li>1 1/4 cup of body temp water</li>
<li>2 tbs oil</li>
<li>2 tbs honey</li>
<li>1 1/2 tsp yeast</li>
<li>3 1/4 cup flour</li>
<li>2 tsp salt</li>
<li>1 tsp vital wheat gluten (to make it fluffy)</li>
</ul>
</div>
</div>

<div id="outline-container-org5743263" class="outline-5">
<h5 id="org5743263">Hamed's Bread</h5>
<div class="outline-text-5" id="text-org5743263">
</div>
<div id="outline-container-orgfbfe42f" class="outline-6">
<h6 id="orgfbfe42f">Ingredients</h6>
<div class="outline-text-6" id="text-orgfbfe42f">
<ul class="org-ul">
<li>3 1/4 cups flour</li>
<li>1 tsp salt</li>
<li>3 tsp sugar</li>
<li>2 tsp canola (olive!?) oil</li>
<li>1 sachet yeast</li>
<li></li>

<li>1 1/2 cup water</li>
</ul>
</div>
</div>

<div id="outline-container-orgbcd5146" class="outline-6">
<h6 id="orgbcd5146">Steps</h6>
<div class="outline-text-6" id="text-orgbcd5146">
<ol class="org-ol">
<li>mix the flour, sugar, salt, and yeast. Set aside this dry mix</li>
<li>mix water and oil</li>
<li>add the dry to the wet and give a good mix. Set aside this starter to rise
<ol class="org-ol">
<li>you can mix in a</li>
</ol></li>
<li>Knead the bread</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb90d5bd" class="outline-4">
<h4 id="orgb90d5bd">Pickles</h4>
<div class="outline-text-4" id="text-orgb90d5bd">
</div>
<div id="outline-container-org99fb535" class="outline-5">
<h5 id="org99fb535">Salt + Vinegar Hot Pickled Cukes</h5>
<div class="outline-text-5" id="text-org99fb535">
<p>
Best way to figure this out is mix up a picklin juice that tastes like the
pickles you want.
</p>

<p>
Then boil the juice, and add it to a jar packed with veggies.
</p>

<p>
Harder veggies [carrots!] can be par-boiled first.
</p>

<p>
First cut used much salt and a bit less white vinegar.
</p>

<p>
Ideas for mix-ins:
</p>

<ul class="org-ul">
<li>Mustard seeds (crushed?)</li>
<li>Dill</li>
<li>Crushed peppers</li>
<li>Chopped garlic</li>
<li>Jalapenos</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd9f584d" class="outline-4">
<h4 id="orgd9f584d">Granola</h4>
<div class="outline-text-4" id="text-orgd9f584d">
</div>
<div id="outline-container-org057c1dd" class="outline-5">
<h5 id="org057c1dd">Basic</h5>
<div class="outline-text-5" id="text-org057c1dd">
<ol class="org-ol">
<li>Mix granola + nut + berry shit [dry]</li>
<li>Separately mix maple syrup [2?] egg white, vanilla to taste [wet]</li>
<li>Keep dry stuff moist with wet stuff</li>
<li>Bake @ 250℉ until it starts to brown</li>
<li>Crack door + turn off oven</li>
<li>Leave until super crispy</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org0b9d2e9" class="outline-4">
<h4 id="org0b9d2e9">Baked Veggies</h4>
<div class="outline-text-4" id="text-org0b9d2e9">
</div>
<div id="outline-container-org8bfee14" class="outline-5">
<h5 id="org8bfee14">Roasted Broccoli / Cauliflower / Brussel Sprouts</h5>
<div class="outline-text-5" id="text-org8bfee14">
<ul class="org-ul">
<li>Preheat oven to 400℉ for crispy</li>
<li>Chop down veggies</li>
<li>Spread veggies across cooking pan</li>
<li>Sprinkle with oil &amp; flavor, e.g.
<ul class="org-ul">
<li>salt &amp; pepper</li>
<li>vinegar (balsamic, rice)</li>
<li>soy sauce</li>
<li>hot sauce</li>
<li>?</li>
</ul></li>
<li>Bake until just crispy, or to your taste</li>
</ul>
</div>
</div>

<div id="outline-container-org8bf2748" class="outline-5">
<h5 id="org8bf2748">Eggplant Parmesan</h5>
<div class="outline-text-5" id="text-org8bf2748">
<ul class="org-ul">
<li>3 eggplant, thinly sliced</li>
<li>16oz mozzarella (shred)</li>
<li>1/2 cup grated parmesan</li>
<li>2 eggs, beaten</li>
<li>4 cups breadcrumbs</li>
</ul>

<p>
Bake until the top has that golden fried cheese look. It takes longer than I'd
expected to get the eggplant cooked all the way through.
</p>
</div>
</div>
</div>

<div id="outline-container-org9c8eecd" class="outline-4">
<h4 id="org9c8eecd">Sauces</h4>
<div class="outline-text-4" id="text-org9c8eecd">
</div>
<div id="outline-container-org4d923bd" class="outline-5">
<h5 id="org4d923bd">Roux</h5>
<div class="outline-text-5" id="text-org4d923bd">
<p>
Equal parts flour and fat, mix with water and continuously stir over low heat
until completely smooth.
</p>

<p>
Awesome pie filler.
</p>

<p>
<a href="https://www.reaper.fm/">Reaper</a> is an excellent digital audio workstation, but it's often bafflingly
complex. This page is a living reference of resoureces I've found useful for
working with Reaper.
</p>
</div>
</div>

<div id="outline-container-org4d42d3f" class="outline-5">
<h5 id="org4d42d3f">Tahini</h5>
<div class="outline-text-5" id="text-org4d42d3f">
</div>
<div id="outline-container-orgb6159f2" class="outline-6">
<h6 id="orgb6159f2">Ingredients</h6>
<div class="outline-text-6" id="text-orgb6159f2">
<ul class="org-ul">
<li>Sesame seeds</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-orgcf1aff7" class="outline-6">
<h6 id="orgcf1aff7">Steps</h6>
<div class="outline-text-6" id="text-orgcf1aff7">
<ul class="org-ul">
<li>Roast the sesame seeds</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org089f357" class="outline-4">
<h4 id="org089f357">Rice</h4>
<div class="outline-text-4" id="text-org089f357">
</div>
<div id="outline-container-org0a1cf22" class="outline-5">
<h5 id="org0a1cf22">Basic Fried Rice</h5>
<div class="outline-text-5" id="text-org0a1cf22">
</div>
<div id="outline-container-org3599930" class="outline-6">
<h6 id="org3599930">Ingredients</h6>
<div class="outline-text-6" id="text-org3599930">
<ul class="org-ul">
<li>oil
<ul class="org-ul">
<li>an oil with a high smoke point is good, e.g. grapeseed oil</li>
</ul></li>
<li>rice
<ul class="org-ul">
<li>fluff it up if it's been in the fridge</li>
</ul></li>
<li>onion</li>
<li>garlic
<ul class="org-ul">
<li>diced</li>
<li>I usually go heavy, tossing in a few cloves</li>
</ul></li>
<li>ginger
<ul class="org-ul">
<li>can be grated right into the pan</li>
</ul></li>
<li>eggs</li>
<li>some seasonings, e.g.
<ul class="org-ul">
<li>soy sauce</li>
<li>rice vinegar</li>
<li>garlic powder</li>
<li>salt &amp; pepper</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgee7a258" class="outline-6">
<h6 id="orgee7a258">Steps</h6>
<div class="outline-text-6" id="text-orgee7a258">
<ol class="org-ol">
<li>pour in the oil and heat it up to the verge of burning the oil</li>
<li>prepare and add in the slow cooking vegetables, e.g. onion, garlic, and ginger
<ol class="org-ol">
<li>season with dry seasonings until tasty</li>
<li>saute until the veggies are half-coked (golden rather than browned)</li>
</ol></li>
<li>add and fry rice
<ol class="org-ol">
<li>mix in the rest of the seasonings until tasty</li>
<li>add more oil if necessary, but the less oil the fluffier the fry</li>
<li>fry until browned on the bottom of the pan, then mix -- shift the pan and
repeat until full of delicious brown chunks</li>
</ol></li>
<li>shift the rice to the edges of the pan and add eggs to the middle
<ol class="org-ol">
<li>before adding: mix and lightly season the eggs in a separate bowl</li>
<li>let the eggs form up, then mix into the rest of the rice</li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>

  </div>
</div>

<div>
    <div class="post-meta row">
      <div class="six columns">
        <p>
          Written by <span title="author" class="post-info">Thomas Moulia</span>
        </p>
        <p>
          Tags: <span title="tags" class="post-info"><a href="/tags/food/">food</a></span>
        </p>
      </div>
      <div class="six columns">
        <p>
          Published:
          <span title="post date" class="post-info">2018-12-29</span>
        </p>
        <p>
          Modified:
          <span title="last modification date" class="post-info">2019-03-19</span>
        </p>
      </div>
    </div>
  <hr />
  <script src="http://code.jquery.com/jquery-latest.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
  <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
    <script type="text/javascript">
     var _gaq = _gaq || [];
     _gaq.push(['_setAccount', 'UA-60774978-1']);
     _gaq.push(['_trackPageview']);
     (function() {
         var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
         ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
         var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
     })();
    </script>
  <div class="footer container">
    <div class="row">
      <div class="six columns">
        <p>
          Copyright &copy; 2015 -
          <span id="footerYear"></span>
        </p>
        <p>
          by <a href="mailto:jtmoulia &lt;at&gt; gmail &lt;dot&gt; com">Thomas Moulia</a>
        </p>
      </div>
      <div class="six columns">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Powered by
          <a href="https://github.com/kelvinh/org-page">org-page</a> and
          <a href="http://getskeleton.com/">skeleton</a>
        </p>
      </div>
    </div>
  </div>
</div>
<script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>

  </body>
</html>
